import React, { Component } from 'react';

class Bishop extends Component {
  render() {
    return (
      <svg style={{ width: '100%' }}
        xmlns="http://www.w3.org/2000/svg" viewBox="0 0 56.4 63.71">
        <defs>
        </defs>
        <title>Ресурс 15</title>
        <g id="Слой_2" data-name="Слой 2">
          <g id="Слой_1-2" data-name="Слой 1">
            <path style={{ fill: 'red', fillRule: 'evenodd' }} class="cls-1" d="M54.72,63.5c-1.11.46-2.93-.74-7.2-1.19-2.75-.3-5.93.2-8.4-.24a25.66,25.66,0,0,1-6-2.14l-4.67-2.52L23.28,60a25.28,25.28,0,0,1-6,2.16c-2.47.45-5.65-.06-8.4.24-4.27.46-6.09,1.67-7.2,1.2-.47-.2-1.6-.7-1.68-2.88,0-1,1.11-2.58,3.12-2.88,7-1,12.42-.35,16.32-1.44,2.93-.82,4.73-2.58,6.24-3.6a8.45,8.45,0,0,1,2.4-1.14V51.6l.12,0,.12,0v.06a8.63,8.63,0,0,1,2.4,1.13c1.52,1,3.31,2.75,6.24,3.57,3.9,1.08,9.34.4,16.32,1.43,2,.29,3.16,1.83,3.12,2.85-.08,2.16-1.21,2.66-1.68,2.86Z" />
            <rect style={{ fill: 'red', fillRule: 'evenodd' }} x="17.04" y="37.44" width="22.56" height="5.04" />
            <path style={{ fill: 'red', fillRule: 'evenodd' }} class="cls-1" d="M28.2,44.88c-7.22,0-13.08,1.07-13.08,2.4s5.86,2.4,13.08,2.4,13.08-1.07,13.08-2.4S35.42,44.88,28.2,44.88Z" />
            <path style={{ fill: 'red', fillRule: 'evenodd' }} class="cls-1" d="M44.88,26.16c0-5-6.87-16.32-16.68-16.32-8.49,0-16.68,11.28-16.68,16.32s-1.29,9.12,16.68,9.12C45.33,35.28,44.88,31.2,44.88,26.16ZM35,25.2H30v5H26.64v-5h-5V21.84h5v-5H30v5h5Z" />
            <path style={{ fill: 'black', fillRule: 'evenodd' }} class="cls-1" d="M28.2,7.44a3.85,3.85,0,0,0,4-3.72,4,4,0,0,0-7.92,0A3.85,3.85,0,0,0,28.2,7.44Z" />
          </g>
        </g>
      </svg>
    );
  }
}

export default Bishop;